Revit 2024 API
ParameterTypeId.StairsLandingtypeLandingMaterial Property
 "Monolithic Material": Landing Material
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StairsLandingtypeLandingMaterial { get; }
Visual Basic
Public Shared ReadOnly Property StairsLandingtypeLandingMaterial As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StairsLandingtypeLandingMaterial {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace